Функция СведенияОВнешнейОбработке() Экспорт

ДанныеДляРег = Новый Структура();
ДанныеДляРег.Вставить("Наименование", "Изменение дат отгрузок покупателей");
ДанныеДляРег.Вставить("БезопасныйРежим", Истина);
ДанныеДляРег.Вставить("Версия", "ver.: 2.40");
ДанныеДляРег.Вставить("Информация", "Обработка сдвигает даты заказов на указанное количества. В календартных днях.");
ДанныеДляРег.Вставить("Вид", "ДополнительнаяОбработка"); 

ТабЗнКоманды = Новый ТаблицаЗначений;
ТабЗнКоманды.Колонки.Добавить("Идентификатор");
ТабЗнКоманды.Колонки.Добавить("Использование");
ТабЗнКоманды.Колонки.Добавить("Представление");

НовСтрока = ТабЗнКоманды.Добавить();
НовСтрока.Идентификатор = "Изменение дат отгрузок покупателей";
НовСтрока.Использование = "ОткрытиеФормы";
НовСтрока.Представление = "Изменение дат отгрузок покупателей";
ДанныеДляРег.Вставить("Команды", ТабЗнКоманды);

Возврат ДанныеДляРег;

КонецФункции
